cases/channel_linear/cpp/foam_cpp/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

// https://www.cfd-online.com/Wiki/Turbulence_free-stream_boundary_conditions
// nut = Cmu * k^2/epsilon, Cmu = 0.09, nut = 0.002347871376374779
internalField   uniform 0.00235;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            nutkWallFunction;
        value           uniform 0.0;
    }
    "(inlet|outlet)"
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
